app/controllers/expense_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 15)
SELECT * FROM `expenses` WHERE (`expenses`.`user_id` = 15)
---
  def index
    unless session[:user_id]
      flash[:notice] = "Please log in first"
      redirect_to :action => "login"
      return
    end
    @title = "Your Expenditures"
    @user = User.find(session[:user_id])
    @expenditures = Expense.find_all_by_user_id(@user.id)

SELECT * FROM `users` WHERE (`users`.`id` = 15)
INSERT INTO `expenses` (`name`, `expense_date`, `created_at`, `updated_at`, `amount`, `user_id`) VALUES('Fruits', '2010-12-19', '2010-12-19 08:56:33', '2010-12-19 08:56:33', 100.0, 15)
---
  def new
    unless session[:user_id]
      flash[:notice] = "Please log in first"
      redirect_to :action => "login"
      return
    end
    @title = "Create New Expenditure"
    @user = User.find(session[:user_id])
    if param_posted?(:expense)
      @expense = Expense.new(params[:expense])
      @expense.user_id = @user.id
      if @expense.save

SELECT * FROM `users` WHERE (`users`.`id` = 15)
SELECT * FROM `expenses` WHERE (expense_date >= ('2010-12-04') AND expense_date <= ('2010-12-24') ) AND (`expenses`.`user_id` = 15)
---
  def search
      unless session[:user_id]
        flash[:notice] = "Please log in first"
        redirect_to :action => "login"
        return
      end
      @title = "Your Expenditures"
      @user = User.find(session[:user_id])
      @start_date = params[:expense_from_date].present? ? params[:expense_from_date] : 100.years.ago.to_date
      @end_date = params[:expense_to_date].present? ? params[:expense_to_date] : 100.years.from_now.to_date
      @expenditures = Expense.find_all_by_user_id(@user.id, :conditions => ["expense_date >= (?) AND expense_date <= (?) ", @start_date.to_date.strftime("%Y-%m-%d"), @end_date.to_date.strftime("%Y-%m-%d")])

SELECT * FROM `users` WHERE (`users`.`id` = 15)
SELECT * FROM `expenses` WHERE (`expenses`.`id` = 1)
DELETE FROM `expenses` WHERE `id` = 1
---
  def delete
      @title = "Delete Expenditure"
      @user = User.find(session[:user_id])
      @expense = Expense.find(params[:id])
      allow! :exec => :check_user
      @expense.destroy