app/controllers/item_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 2)
SELECT * FROM `user_items` WHERE (`user_items`.`user_id` = 2 AND `user_items`.`item_id` = 1) LIMIT 1
SELECT * FROM `items` WHERE (id IN (1,2,3))
SELECT * FROM `items` WHERE ((id IN (NULL) OR user_id = 20) AND name like '%%') ORDER BY transaction_date DESC LIMIT 0, 10
SELECT * FROM `users`
---
  def index
    unless session[:user_id]
      flash[:notice] = "Please log in first"
      redirect_to :action => "login"
      return
    end
    @title = "Your Transactions"
    @user = User.find(session[:user_id])
    user_items = UserItem.find_all_by_user_id(@user.id).collect(&:item_id)
    @items = Item.find(:all, :conditions => ["id IN (?)", user_items])
    current_page = (params[:page] || 1).to_i

    sort = case params[:sort]
    when "name"  then "name"
    when "user_id"   then "user_id"
    when "amount" then "amount"
    when "date" then "transaction_date"
    when "name_reverse"  then "name DESC"
    when "user_id_reverse"  then "user_id DESC"
    when "amount_reverse"   then "amount DESC"
    when "date_reverse" then "transaction_date DESC"
    end
    @all_items = Item.paginate(:all, :conditions => ["(id IN (?) OR user_id = ?) AND name like ?", user_items, @user.id, "%#{params[:search]}%"], :order => sort, :page => current_page, :per_page => 10)

SELECT * FROM `users` WHERE (`users`.`id` = 2)
INSERT INTO `items` (`name`, `created_at`, `updated_at`, `amount`, `user_id`, `transaction_date`, `type`) VALUES('Water', '2010-12-18 12:00:55', '2010-12-18 12:00:55', 100, 2, '2010-10-10', NULL)
SELECT * FROM `users`
---
  def new
    unless session[:user_id]
      flash[:notice] = "Please log in first"
      redirect_to :action => "login"
      return
    end
    @title = "Create New Item"
    @user = User.find(session[:user_id])
    if param_posted?(:item) && param_posted?(:record)
      @item = Item.new(params[:item])
      @item.user_id = @user.id
      if @item.save
        if param_posted?(:record)
          user_items = params[:record][:users]
          user_items.each do |user_item|

SELECT * FROM `users` WHERE (`users`.`id` = 3)
SELECT * FROM `user_items` WHERE (`user_items`.`item_id` = 2)
---
  def show
      unless session[:user_id]
        flash[:notice] = "Please log in first"
        redirect_to :action => "login"
        return
      end
      @title = "Show Item"
      @user = User.find(session[:user_id])
      @item = Item.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 15)
SELECT * FROM `user_items` WHERE (`user_items`.`item_id` = 31)
DELETE FROM `user_items` WHERE `id` = 39
---
  def delete
      @title = "Delete Item"
      @user = User.find(session[:user_id])
      @item = Item.find(params[:id])
      allow! :exec => :check_user
      UserItem.find_all_by_item_id(@item.id).each do |user_item|
          user_item.destroy