app/controllers/user_controller.rb

  def index
    unless session[:user_id]
      flash[:notice] = "Please log in first"
      redirect_to :action => "login"
      return
    end
    @title = "PG Tracker User Hub"
    @user = User.find(session[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)

  def register
    @title = "Register"
    if param_posted?(:user)
      @user = User.new(params[:user])
      if @user.save
---
INSERT INTO `users` (`salt`, `created_at`, `updated_at`, `hashed_password`, `screen_name`, `email`, `authorization_token`) VALUES('xjZ42T2KFv', '2010-12-25 21:46:41', '2010-12-25 21:46:41', '8939f252b7e3ffb2dea305eb6793753cab3fbdcf', 'sabarish1', 'sabarishsankar89@yahoo.co.in', NULL)

  def edit
    @title = "Edit Profile"
    @user = User.find(session[:user_id])
    if param_posted?(:user)
      attribute = params[:attribute]
      case attribute
      when "email"
        try_to_update @user, attribute
      when "password"
        @user.update_attributes(:password=>params[:user][:password], :password_confirmation => params[:user][:password_confirmation])
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)
UPDATE `users` SET `updated_at` = '2010-12-25 21:45:51', `hashed_password` = '5dfe5a000313ffef37eb2a601d695f00de498d99' WHERE `id` = 15

  def show
    @user = User.find(session[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 5)

  def forgot_password
    @title = "Forgot Password"
    if request.post?
      user = User.find_by_email(params[:user][:email])
---
SELECT `users`.id FROM `users` WHERE (`users`.`email` = BINARY 'sabarishsankar89@gmail.com' AND `users`.id <> 15) LIMIT 1