app/controllers/user_controller.rb

SELECT * FROM `users` WHERE (`users`.`screen_name` = 'sathish' AND `users`.`password` = 'sathish') LIMIT 1
---
  def login
    @title = "Log in to PG Tracker"
    if request.get?
      @user = User.new(:remember_me => remember_me_string)
    elsif param_posted?(:user)
      @user = User.new(params[:user])
      user = User.find_by_screen_name_and_password(@user.screen_name,
        @user.password)